{"created":"2025-10-09 13:14:38","title":"MetricalARGS: A Taxonomy for Studying Metrical Poetry with LLMs","abstract":"Prior NLP work studying poetry has focused primarily on automatic poem generation and summarization. Many languages have well-studied traditions of poetic meter which enforce constraints on a poem in terms of syllable and phoneme patterns. Such advanced literary forms offer opportunities for probing deeper reasoning and language understanding in Large Language Models (LLMs) and their ability to follow strict pre-requisites and rules. In this paper, we introduce MetricalARGS, the first taxonomy of poetry-related NLP tasks designed to evaluate LLMs on metrical poetry across four dimensions: Analysis, Retrieval, Generation, and Support. We discuss how these tasks relate to existing NLP tasks, addressing questions around datasets and evaluation metrics. Taking Telugu as our example language, we illustrate how the taxonomy can be used in practice. MetricalARGS highlights the broader possibilities for understanding the capabilities and limitations of today's LLMs through the lens of metrical poetry.","sentences":["Prior NLP work studying poetry has focused primarily on automatic poem generation and summarization.","Many languages have well-studied traditions of poetic meter which enforce constraints on a poem in terms of syllable and phoneme patterns.","Such advanced literary forms offer opportunities for probing deeper reasoning and language understanding in Large Language Models (LLMs) and their ability to follow strict pre-requisites and rules.","In this paper, we introduce MetricalARGS, the first taxonomy of poetry-related NLP tasks designed to evaluate LLMs on metrical poetry across four dimensions: Analysis, Retrieval, Generation, and Support.","We discuss how these tasks relate to existing NLP tasks, addressing questions around datasets and evaluation metrics.","Taking Telugu as our example language, we illustrate how the taxonomy can be used in practice.","MetricalARGS highlights the broader possibilities for understanding the capabilities and limitations of today's LLMs through the lens of metrical poetry."],"url":"http://arxiv.org/abs/2510.08188v1"}
