{"created":"2025-01-21 07:16:18","title":"Web vs. LLMs: An Empirical Study of Learning Behaviors of CS2 Students","abstract":"LLMs such as ChatGPT have been widely adopted by students in higher education as tools for learning programming and related concepts. However, it remains unclear how effective students are and what strategies students use while learning with LLMs. Since the majority of students' experiences in online self-learning have come through using search engines such as Google, evaluating AI tools in this context can help us address these gaps. In this mixed methods research, we conducted an exploratory within-subjects study to understand how CS2 students learn programming concepts using both LLMs as well as traditional online methods such as educational websites and videos to examine how students approach learning within and across both scenarios. We discovered that students found it easier to learn a more difficult concept using traditional methods than using ChatGPT. We also found that students ask fewer follow-ups and use more keyword-based queries for search engines while their prompts to LLMs tend to explicitly ask for information.","sentences":["LLMs such as ChatGPT have been widely adopted by students in higher education as tools for learning programming and related concepts.","However, it remains unclear how effective students are and what strategies students use while learning with LLMs.","Since the majority of students' experiences in online self-learning have come through using search engines such as Google, evaluating AI tools in this context can help us address these gaps.","In this mixed methods research, we conducted an exploratory within-subjects study to understand how CS2 students learn programming concepts using both LLMs as well as traditional online methods such as educational websites and videos to examine how students approach learning within and across both scenarios.","We discovered that students found it easier to learn a more difficult concept using traditional methods than using ChatGPT.","We also found that students ask fewer follow-ups and use more keyword-based queries for search engines while their prompts to LLMs tend to explicitly ask for information."],"url":"http://arxiv.org/abs/2501.11935v2"}
